app/views/dashboard/index.html.erb

        <i class="bi bi-table fs-1"></i>
        <h3 class="mt-2"><%= Table.count %></h3>
---
SELECT COUNT(*) FROM "tables"