app/views/reservations/new.html.erb

            <%= f.label :table_id, "Select Table", class: "form-label" %>
            <%= f.select :table_id,
                  @tables.map { |t| ["Table ##{t.table_number} (Capacity: #{t.capacity})", t.id] },
                  { prompt: "Choose a table" },
                  class: "form-select" %>
---
SELECT "tables".* FROM "tables" ORDER BY "tables"."table_number" ASC