app/controllers/dashboard_controller.rb

SELECT COUNT(*) FROM "reservations" WHERE "reservations"."user_id" = 1
SELECT "reservations".* FROM "reservations" WHERE "reservations"."user_id" = 1 AND (date >= '2026-05-03') ORDER BY "reservations"."date" ASC, "reservations"."time_slot" ASC LIMIT 3
---
  def index
    @reservations_count = current_user.reservations.count
    @upcoming_reservations = current_user.reservations.where("date >= ?", Date.today).order(:date, :time_slot).limit(3)