app/controllers/reservations_controller.rb

SELECT "reservations".* FROM "reservations" WHERE "reservations"."user_id" = 1 ORDER BY "reservations"."date" DESC, "reservations"."time_slot" DESC
SELECT "tables".* FROM "tables" WHERE "tables"."id" IN (4, 1)
---
  def index
    @reservations = current_user.reservations.includes(:table).order(date: :desc, time_slot: :desc)

SELECT "tables".* FROM "tables" ORDER BY "tables"."table_number" ASC
---
  def new
    @reservation = current_user.reservations.build
    @reservation.table_id = params[:table_id] if params[:table_id]
    @tables = Table.all.order(:table_number)

INSERT INTO "reservations" ("user_id", "table_id", "date", "time_slot", "created_at", "updated_at") VALUES (1, 1, '2026-05-04', '17-18', '2026-05-03 18:23:23.399023', '2026-05-03 18:23:23.399023') RETURNING "id"
SELECT "tables".* FROM "tables" ORDER BY "tables"."table_number" ASC
---
  def create
    @reservation = current_user.reservations.build(reservation_params)
    if @reservation.save
      redirect_to reservations_path, notice: "Table booked successfully!"
    else
      @tables = Table.all.order(:table_number)

SELECT "reservations".* FROM "reservations" WHERE "reservations"."user_id" = 1 AND "reservations"."id" = 4 LIMIT 1
DELETE FROM "reservations" WHERE "reservations"."id" = 4
---
  def destroy
    @reservation = current_user.reservations.find(params[:id])
    @reservation.destroy