app/controllers/tables_controller.rb

  def index
    @tables = Table.all.order(:table_number)
---
SELECT "tables".* FROM "tables" ORDER BY "tables"."table_number" ASC